package com.example.sarashpaz;

import androidx.appcompat.app.AppCompatActivity;

import android.content.Context;
import android.os.Bundle;
import android.view.View;
import android.widget.GridView;
import android.widget.ImageView;
import android.widget.TextView;

import com.example.sarashpaz.adapter.AdapterMenu;
import com.example.sarashpaz.model.ItemRecycler;

import java.util.ArrayList;

import uk.co.chrisjenx.calligraphy.CalligraphyContextWrapper;

public class ActivityMenu extends AppCompatActivity {

    /*create object for xml*/
    private ImageView imgBackDastebandi;
    TextView txtTitle;
    GridView gridView;

    public static String titleMenu;
    public ArrayList<ItemRecycler> listsoap, listmidern, listsonati,
            listtanagholat, listrejimi, listdaneshjoee;

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_menu);

        /* Get object from xml file*/
        txtTitle = findViewById(R.id.txttitledastehbandi);
        txtTitle.setText(titleMenu);
        imgBackDastebandi = findViewById(R.id.img_backdastehbandi);
        gridView = findViewById(R.id.grid_menu);

        /*2.get value from Dastebandi for load menu items*/
        Bundle bundle = getIntent().getExtras();
        Boolean soap = bundle.getBoolean("soap");

        Bundle bundle1 = getIntent().getExtras();
        Boolean modern = bundle1.getBoolean("modern");

        Bundle bundle2 = getIntent().getExtras();
        Boolean sonati = bundle2.getBoolean("sonati");

        Bundle bundle3 = getIntent().getExtras();
        Boolean tanagholat = bundle3.getBoolean("tanagholat");

        Bundle bundle4 = getIntent().getExtras();
        Boolean rejimi = bundle4.getBoolean("rejimi");

        Bundle bundle5 = getIntent().getExtras();
        Boolean daneshjuee = bundle5.getBoolean("daneshjuee");

        /*3.set adapter to gridview */
        if (soap) {
            setSoap();
            AdapterMenu adapter = new AdapterMenu(ActivityMenu.this, R.layout.item_menu, listsoap);
            gridView.setAdapter(adapter);
        } else if (modern) {
            setModern();
            AdapterMenu adapter = new AdapterMenu(ActivityMenu.this, R.layout.item_menu, listmidern);
            gridView.setAdapter(adapter);
        } else if (sonati) {
            setSonati();
            AdapterMenu adapter = new AdapterMenu(ActivityMenu.this, R.layout.item_menu, listsonati);
            gridView.setAdapter(adapter);
            ActivityDastebandi.sonati = false;
        } else if (tanagholat) {
            setTangholat();
            AdapterMenu adapter = new AdapterMenu(ActivityMenu.this, R.layout.item_menu, listtanagholat);
            gridView.setAdapter(adapter);
            ActivityDastebandi.tanagholat = false;
        } else if (rejimi) {
            setRejimi();
            AdapterMenu adapter = new AdapterMenu(ActivityMenu.this, R.layout.item_menu, listrejimi);
            gridView.setAdapter(adapter);
            ActivityDastebandi.rejimi = false;
        } else if (daneshjuee) {
            setDaneshjuee();
            AdapterMenu adapter = new AdapterMenu(ActivityMenu.this, R.layout.item_menu, listdaneshjoee);
            gridView.setAdapter(adapter);
            ActivityDastebandi.daneshjuee = false;
        }

        /*4.back to dastebandi*/
        imgBackDastebandi.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                finish();
                ActivityDastebandi.tanagholat = false;
                ActivityDastebandi.daneshjuee = false;
                ActivityDastebandi.rejimi = false;
                ActivityDastebandi.sonati = false;
                ActivityDastebandi.modern = false;
                ActivityDastebandi.soap = false;

            }
        });
    }

    /*1.methods for set item list grid*/

    public void setSonati() {
        listsonati = new ArrayList<>();
        listsonati.add(new ItemRecycler(R.drawable.img5, "مرصع پلو",
                "مرغ کامل :  1 عدد\n" +
                        "پیاز :  2 عدد متوسط\n" +
                        "زعفران :   1/3 ق چ\n" +
                        "مغز گرد :  1/2 لیوان\n" +
                        "خلال پسته :  1/2 لیوان \n" +
                        "خلال بادام:   1/2 لیوان\n" +
                        " خلال پوست پرتقال یا نارنج :   1/3 لیوان\n" +
                        " کشمش :  1 لیوان \n" +
                        "زرشک :  1 لیوان\n" +
                        "زردچوبه :  1/2 ق چ\n" +
                        "نمک :  به میزان لازم\n" +
                        "شکر  در صورت نیاز:به میزان لازم",
                "ابتدا  برنج را بشویید و با کمی نمک و آب چند ساعت خیس کنید.\n" +
                        "سپس موادی نظیر (مرغ ،خلال پرتقال ، زرشک و کشمش ) را که برای تزیین  برنج استفاده میشوند آماده کنید.\n" +
                        "برای این کار هم باید زرشک و کشمش را از 2 ساعت قبل در آب سرد به صورت جداگانه خیس کنید تا اگر احیانا گل و یا سنگ ریزه ای داشت ته نشین شود.سپس مرغ را به چهار قسمت تقسیم کنید و به همراه مقداری نمک ،زردچوبه و 1 عدد پیاز و مقداری آب بپزید تا گوشت مرغ کاملا پخته شود .\n" +
                        "مرغ پخته شده را از استخوان جدا کنید و به قطعات کوچکتر برش دهید.\n" +
                        " همچنین اگر خلال پرتقال یا نارنج شیرین شده تهیه کردید که نیازی نیست برای شیرین شدنش کاری بکنید ولی در غیر این صورت باید خلال ها را چند بار در آب خیس کنید و آب آن را خالی کنید و در مرحله بعد در آب جوش یکی دو قول جوش بزنید و  آب آن را خالی کنید.این کار را 3 دفعه انجام دهید تا تلخی خلال های پرتقال کاملا از بین برود.بعد از شیرین شدن خلال ها آن ها را در مقداری روغن داغ بر روی حرارت ملایم به اندازه یکی دو چرخ تفت دهید .\n" +
                        "و در پایان به اندازه یک قاشق سوپ خوری شکر روی آن بریزید و خوب مخلوط کنید و وقتی خلال ها یکدست شد آنرا از روی حرارت بردارید تا در اثر حرارت شکر ذوب شود.\n" +
                        "زرشک و کشمش را هم بعد از اینکه خوب خیس خوردند از آب بیرون میاوریم. و نصف پیاز را با روغن تفت میدهیم و وقتی رنگ پیاز ها طلایی شد زرشک ها را داخل آن میریزیم و یک تفت کوچک میدهیم تا زرشک ها نسوزند.اگر هم زرشک ها ترش مزه بودند میتوانید یک دو قاشق سوپخوری شکر به آن اضافه کنید و مزه آن را شیرین کنید.\n" +
                        " همچنین نصف دیگر پیاز ها را هم با مقداری روغن تفت میدهیم و بعد از اینکه رنگ پیاز طلایی شد کشمش رادر آن کمی تفت میدهیم و آماده میکنیم.\n" +
                        " بعد از آماده سازی مواد تزیین پلو ، برنج را که از قبل خیس خورده شده آبکش میکنیم و دم میدهیم .\n" +
                        " مرغ پخته و آماده شده را با زرشک و کشمش مخلوط کنید و در هنگام سرو برنج با نصف چلو مخلوط کنید و مقداری از برنج را هم با زعفران دم کرده مخلوط کنید و به همراه خلال ها روی برنج بریزید . در آخر هم میتوانید مقداری روغن داغ کنید و روی برنج بکشید."));
        listsonati.add(new ItemRecycler(R.drawable.kabab, "برای کباب کوبیده زعفرانی",
                "گوشت چرخ کرده :یک کیلو\n" +
                        "پیاز متوسط :4 عدد\n" +
                        "نمک و فلفل:به مقدار لازم\n" +
                        "زعفران :به مقدار لازم",
                "در تهیه این کباب، از گوشت چرخ کرده ای که 30 در صد چربی داشته باشد استفاده کنید. گوشت را در یک ظرف مسی بریزید و پیاز را داخل آن رنده کنید.\n" +
                        "نمک، فلفل و زعفران را اضافه کنید و تا جایی که می توانید، گوشت را ورز دهید تا حدی که گوشت، حالت چسبندگی پیدا کند. می توان برای ایجاد چسبدگی بیشتر، از زرده یک تخم مرغ استفاده کرد.\n" +
                        "برای سیخ کردن کباب هم باید توجه داشته باشید که از سیخ های پهن برای پخت این کباب باید استفاده کنید.\n" +
                        "قبل از اینکه شروع به کار کنید، مقدماتی لازم است. ابتدا در کاسه کوچکی مقداری آب سرد بریزید و کنار دست تان قرار دهید. حالا پیش از برداشتن مایه کباب دست تان را در آب خیس کرده، یک مشت از مایه را بردارید و به شکل دوک درآورید؛ سپس همان طور که مواد در دست راست تان قرار دارد، سیخ را روی مایه دوکی بگذارید و شروع به پوشاندن سطح سیخ با مایه کباب کنید.\n" +
                        "در پایان دوباره دست تان را در آب سرد فرو کنید و روی سیخ فشار دهید تا اثر انگشتان شما بر گوشت باقی بماند. حالا ابتدا و انتهای کباب را به سیخ بچسبانید و کناری بگذارید. همین کار را درباره همه مواد و سیخ ها انجام دهید."));
        listsonati.add(new ItemRecycler(R.drawable.qeime, "خورش قیمه",
                "گوشت :200 گرم\n" +
                        "لپه :70 گرم\n" +
                        "رب :1-2 قاشق \n" +
                        "پیاز عسلی :3-4 قاشق\n" +
                        "چوب دارچین :1عدد\n" +
                        "هل سبز :5 -6 عدد\n" +
                        "گلاب :1 قاشق\n" +
                        "زرشک :برای تزیین  2 قاشق  \n" +
                        "روغن :2قاشق",
                "ابتدا باید درون قابلمه مناسب پیاز عسلی از قبل سرخ شده را به همراه گوشت و کمی روغن به مدت 10 الی 12 دقیقه با حرارت پایین تفت میدهیم .نکته مهم و قابل توجه در مورد این خورش طرد بودن گوشت خورش است که برای این کار بهتر است گوشت مان را از شب قبل با کمی فلفل و روغن مخلوط کرده و استراحت دهیم.\n" +
                        "بعد از تفت گوشت و پیاز با حرارت بالا لپه و رب را به مواد ما اضافه میکنیم و حرارت را کمی بیشتر میکنیم و شروع میکنیم به تفت دادن تا مواد کاملاً در هم مخلوط شوند و رنگ رب در روغن جذب شود و خورش ما خوشرنگ تر شود و به اندازه 2 لیوان آب ولرم به غذا اضافه میکنیم.\n" +
                        "تا به جوش بیاید و بعد حرارت را کم میکنیم تا خورش ما آرام آرام بپزد . بخاطر اینکه به گوشتمان فلفل اضافه کردیم گوشت خورش سریعتر می پزد. بقیه مواد مثل گلاب و لیمو عمانی ،نمک و ادویه جات را در 10 دقیقه آخر به خورشتان اضافه کنید و حتما هل و دارچین را از قبل بجوشانید و با کمی آب به خورشتتان اضافه کنید.\n" +
                        "سپس می توانید سیب زمینی ها را به صورت خلالی و یا شکل دلخواه در آورده و برای تزیین به خورش قیمه دلچسپتان اضافه کنید.\n"));
        listsonati.add(new ItemRecycler(R.drawable.img6, "قورمه سبزی ",
                "گوشت سر دست با مغز ران بدون استخوان :نیم کیلو گرم\n" +
                        "پیاز سرخ کرده :3 قاشق سوپخوری\n" +
                        "روغن (حیوانی یا نباتی) :250 گرم\n" +
                        "لیمو عمانی (یا گرد لیمو) :5 تا 6 عدد\n" +
                        "لوبیا قرمز یا لوبیای چیتی (بسته به سلیقه) :نیم لیوان\n" +
                        "سبزی خورش (تره ، جعفری ، گشنیز ، شنبلیله و نعناع ) :1 کیلو گرم\n" +
                        "نمک :به مقدار لازم\n" +
                        "زردچوبه :به مقدار لازم\n" +
                        "فلفل : به مقدار لازم" ,
                "ابتدا پس از تمیز کردن گوشت و بعد از خرد کردن پیاز این دو را با هم در یک جا تفت میدهیم . در مرحله بعدی زردچوبه را به این گوشت و پیاز افزوده و همراه با آب و لوبیا قرمز مخلوط کرده و آن را حرارت میدهیم. این حرارت را تا جایی ادامه می دهیم که گوشت نیم پز شود.\n" +
                        "حال سبزیجات خود که شامل تره ، جعفری ، گشنیز ، شنبلیله و چند پر نعناع میباشد را تمیز کرده و پس از شستشو دادن آنها را خرد میکنیم\n" +
                        "وقت آن رسیده است که این سبزی ها را نیز به غذای خود اضافه کنیم . در مرحله بعد ادویه های خود را به آن اضافه کنیم . به صورت پیشفرض فلفل و نمک برای قورمه سبزی کافیست . اما شما بر حسب تجربه می توانید از ادویه های دیگر استفاده کنید.\n" +
                        "بعد از اینکه غذای ما چند بار جوش خورد ، وقت آن می رسد که لیمو عمانی را به غذا اضافه کنیم . دقت داشته باشید که بر روی لیمو عمانی چند سوراخ کوچک ایجاد کنید تا غذا پخش شود . به یاد داشته باشید که اگر لیمو عمانی شما تلخ باشد تمام قرمه سبزی شما تلخ خواهد شد.\n" +
                        "پس اگر از کیفیت لیمو عمانی خود اطمینان ندارید سعی کنید از گرد لیمو استفاده کنید . شما می توانید یک سوم پیمانه آب غوره هم به خورشت اضافه کنید البته این دلبخواهی و بستگی به مزاج شما دارد . حال منتظر می مانیم تا غذا پخته شود . به یاد داشته باشید زمانی متوجه می شویم که غذا پخته است که یک سطح روغنی روی غذا به وجود بیاید.\n"));
        listsonati.add(new ItemRecycler(R.drawable.img2, "مرغ سلطانی",
                "مرغ :1400 گرم\n" +
                        "سیب زمینی سرخ شده :700 گرم\n" +
                        "لیمو ترش :2 عدد\n" +
                        "سیر، زنجفیل تازه، فلفل قرمز چیلی :یک قاشق سوپ خوری\n" +
                        "گوجه فرنگی فیله شده :یک عدد\n" +
                        "پودر گشنیز، زردچوبه، گرام ماسالا و زیره سبز :یک قاشق سوپ خوری\n" +
                        "ماست :2 قاشق چایخوری\n" +
                        "نمک :2 قاشق چای خوری",
                "برای درست کردن ترکیبات چاشنی:سیر، فلفل قرمز و زنجفیل را رنده می کنیم تا ترکیب آنها 1 قاشق سوپ خوری پر شود.\n" +
                        "گوجه فرنگی را داخل میکسر پوره کنید 1 قاشق سوپ خوری از آن برای مزه دار کردن مرغ کافی است.\n" +
                        "از ترکیب پودر گشنیز، زردچوبه، گرام ماسالا و زیره سبز هم 1 قاشق سوپ خوری پُر نیاز است.\n" +
                        "در ابتدا بافت زیر استخوان ران مرغ را چند بار برش می زنیم.\n" +
                        "یک تابه سرخ کن بزرگ (کمی بزرگ تر از اندازه مرغ) آماده کرده، مرغ و ترکیب چاشنی را در آن می ریزیم و به خوبی مخلوط می کنیم.\n" +
                        "با استفاده از دستکش، مرغ را به خوبی ماساژ می دهیم تا چاشنی کاملا داخل و روی مرغ را بپوشاند، در صورت امکان مرغ را به مدت یک شب در یخچال نگه می داریم.\n" +
                        "فر را از قبل با حرارت 200 درجه سانتی گراد گرم می کنیم.\n" +
                        "لیمو ترش را با چاقو چند برش کوچک زده و داخل شکم مرغ قرار می دهیم. پس از آن مرغ را بر روی سینی فر قرار می دهیم.\n" +
                        "  2 پیمانه آب یا در صورت تمایل آب مرغ را بر روی مرغ ریخته و سینی را در طبقه پایین فر جا می دهیم. حدود 1 ساعت و 20 دقیقه مواد را می پزیم.\n" +
                        "پس از پخته شدن مرغ، آن را بر روی یک سطح صاف و تمیز قرار داده و با دقت تکه های سیاه و سوخته مرغ را جدا می کنیم تا سطح شفاف بافت گوشت مرغ مشخص شود.\n" +
                        "سپس مرغ را همراه با سیب زمینی و آب مرغ (اگر دوست داشتید) روی میز می چینیم.\n" +
                        "غذا را با برگ های گشنیز تزیین کرده و در کنار ادویه انتخابی خود سرو می کنیم."));
        listsonati.add(new ItemRecycler(R.drawable.nesar1, "قیمه نثار ",
                "برنج خیس کرده3 پیمانه\n" +
                        "گوشت قیمه خرد شده350 گرم\n" +
                        "پیاز خرد کرده ریز2 عدد\n" +
                        "لپه خیس کرده1/2 پیمانه\n" +
                        "روغن1/2 پیمانه\n" +
                        "رب گوجه فرنگی2 قاشق س\n" +
                        "ادویه خورشتی1 قاشق چ\n" +
                        "ادویه پلویی1 قاشق چ\n" +
                        "گلاب1 قاشق س\n" +
                        "زعفران دم کرده1 قاشق س\n" +
                        "زرشک خشک شده1/2 پیمانه\n" +
                        "گرد لیمو عمانی مقداری\n" +
                        "نمک مقداری\n" +
                        "خلال پسته و بادام ",
                "طرز تهیه سنتی"));
    }

    public void setModern() {
        listmidern = new ArrayList<>();
        listmidern.add(new ItemRecycler(R.drawable.hamberger1, "همبرگر",
                " گوشت چرخ کرده :100 گرم\n" +
                "پنیر پیتزا :به مقدار دلخواه\n" +
                "زرده تخم مرغ :دو عدد\n" +
                "پیاز :یک عدد\n" +
                "نمک :به میزان لازم\n" +
                "فلفل :به میزان لازم\n" +
                "پودر گردو :در صورت تمایل\n" +
                "روغن :به میزان لازمهمبرگر\n",
                "پیاز را سرخ میکنیم و بعد به گوشت اضافه کرده و به خوبی مخلوط میکنیم .\n" +
                "    زرده را به گوشت اضافه کرده به خوبی ماساژ میدهیم و بعد نیز نمک و فلفل را به آن اضافه میکنیم .\n" +
                "    روی تخته پودر نان میپاشیم ، گلوله هایی به اندازه نارنگی از مواد را برداشته ، بروی تخته گرد کرده و نازک میکنیم ، سپس در تابه چدنی سرخ میکنیم .\n" +
                "    بعد از این که همبرگر ها آماده شدند ، بر روی آنها مقداری پنیر پیتزا ریخته و آن را برای مدت زمان چند دقیقه درون فر میگذاریم تا پنیر باز شود .\n"));
        listmidern.add(new ItemRecycler(R.drawable.meigusokhari1,
                "میگو سوخاری",
                "میگو: 1 کیلو\n" +
                        "آبلیمو: یک قاشق سوپخوری\n" +
                        "ماست:دو قاشق سوپخوری\n" +
                        "پیاز: یک عدد\n" +
                        "آرد : 2/3 لیوان\n" +
                        "تخم مرغ : یک عدد\n" +
                        "زعفران : نصف قاشق چایخوری\n" +
                        "نمک : به مقدار لازم\n" +
                        "بیکینگ پودر:یک قاشق چایخوری\n" +
                        "فلفل : به مقدار لازم\n",
                "     اول میگو را تمیز میکنیم پوست آن را کنده ، میشوییم و سپس آن را در آب پیاز که قبلا آن را رنده کرده و آب آن را جدا کرده ایم می ریزیم.\n" +
                        "            بعلاوه مقداری آبلیمو و فلفل سیاه. بعد آن را مخلوط می کنیم .\n" +
                        "            در ظرف را بسته و یک ساعت داخل یخچال قرار می دهیم . \n" +
                        "            سس مخصوص میگو پفکی را با مخلوط کردن آرد ، تخم مرغ، زعفران ، ماست ،بیکینگ پودر و نمک تهیه می کنیم. \n" +
                        "            سس ما نباید زیاد سفت یا شل باشد. اگر سفت شد مقداری ماست و اگر شل شد مقداری آرد به آن بیافزایید.\n" +
                        "            سپس میگوها را از آب پیاز خارج کرده و داخل مایع ریخته ، مخلوط کرده و در ظرف را گذاشته و نیم ساعت درون یخچال قرار می دهیم .\n" +
                        "              یک ظرف کوچک نچسب را روی اجاق گاز قرارداده و داخل آن روغن ریخته و می گذاریم داغ شود.\n" +
                        "            ظرف باید کوچک باشد تا روغن روی میگو ها را بگیرد، پس از اینکه روغن کاملاً داغ شد حرارت را پائین کشیده و میگوها را یکی یکی داخل روغن می ریزیم وقتی یک طرف آن طلایی شد ، میگو را بر می گردانیم تا طرف دیگر آن نیز طلایی شود ، دقت کنید حرارت مقداری باشد که روغن نسوزد .\n"));
        listmidern.add(new ItemRecycler(R.drawable.pitzza1,
                "پیتزا پپرونی",
                "گوشت چرخ کرده:200گرم\n" +
                "فلفل دلمه ای:1عدد\n" +
                "رب گوجه فرنگی :3قاشق غذاخوری\n" +
                "قارچ :200گرم\n" +
                "پیاز :1عدد\n" +
                "کالباس : 200گرم\n" +
                "پنیرپیتزا :به مقدازلازم\n" +
                "نمک فلفل پودر اویشن:به مقذار دلخواه\n",
                "  پیاز راخرد کنید ودرون ماهیتابه بامقداری روغن تفت بدهید تانرم شود سپس گوشت نمک فلفل وپودر اویشن رابه ان اضافه کرده وباحرارت ملایم تفت میدهیم!پس از اینکه رنگ گوشت تغییر کرد 1قاشق رب گوجه فرنگی اضافه نموده ودوباره تفت میدهیم وپس از 5دقیقه از روی حرارت اجاق برمیداریم!\n" +
                        "        کالباس رامکعبی خرد کنید پیاز راحلقه ای خرد کنید فلفل دلمه ای را ریز کرده مقداری زیتون هم ریز کنید!\n" +
                        "        خمیر پیتزا را نازک پهن کنید 2قاشق رب گوجه فرنگی راتفت داده تا بوی خامی ندهد سپس با قلمو روی خمیر پیتزا پخش کنید ومقداری پنیر بریزید وتمامی موادی راکه خرد کرده بودید(کالباس پیاز و...)به همراه مایه گوشتی روی خمیر بچینید ودر انتها با لایه کاملی از پنیر پیتزا پوشش دهیدوروی ان زیتون بریزیدو اجازه دهید پیتزای شما 20دقیقه بماند تا خمیر استراحت کند ودر زمان پخت خوب ترد وبرشته شود.\n" +
                        "        پیتزا را به مدت 15الی 20 دقیقه در طبقه وسط فر میگذاریم البته فر را باید از قبل در دمای 180 درجه گرم کنید!\n" +
                        "        در صورتیکه میخواهید روی پیتزای شما طلایی شود گریل بالا را روشن کنید ومواظب باشد پنیر پیتزایتان نسوزد! پیتزایتان را باسس دلخواه سرو نمایید\n"));
        listmidern.add(new ItemRecycler(R.drawable.kitchen, "کیچن استراگانوف", "مواد لازم مدرن", "طرز تهیه مدرن"));
        listmidern.add(new ItemRecycler(R.drawable.sokhari, "مرغ سوخاری", "مواد لازم مدرن", "طرز تهیه مدرن"));
        listmidern.add(new ItemRecycler(R.drawable.img3, "هات داگ", "مواد لازم مدرن", "طرز تهیه مدرن"));
    }

    public void setSoap() {
        listsoap = new ArrayList<>();
        listsoap.add(new ItemRecycler(R.drawable.soupjo,
                "سوپ جو قرمز",
                "جو پرک :3/4 لیوان\n" +
                        "آب مرغ :   7 لیوان\n" +
                        "پیاز :1 عدد متوسط\n" +
                        "هویج :2 عدد متوسط\n" +
                        "آبلیمو:2 قاشق غذا خوری\n" +
                        "رب گوجه :یک و نیم قاشق غذا خوری\n" +
                        "آرد :2 قاشق غذا خوری سر پر\n" +
                        "آب :1 لیوان\n" +
                        "جعفری خشک :1 قاشق غذا خوری سرپر\n" +
                        "ادویه کاری :نصف قاشق چایخوری\n" +
                        "نمک و فلفل سیاه :به مقدار کافی\n",
                "ابتدا اسکلت مرغ و هویج وزعفران و سیر وپیاز ونمک و برگ بو را با حدود دو و نیم لیتر آب می گذاریم تا بپزه و سپس آنرا صاف می کنیم .. آب مرغ را هم می تونیم در فریزر نگهداری کنیم و برای درست کردن سوپ از آن استفاده کنیم ..\n" +
                        "پیاز وهویج را خیلی ریز خرد می کنیم.\n" +
                        "مواد فوق را به همراه آب مرغ و جوپرک را روی حرارت می گذاریم تا به جوش بیاد و سپس حرارت را ملایم می کنیم ودر قابلمه را می گذاریم تا حدود نیم ساعت بپزه.\n" +
                        "سپس آرد را دریک لیوان آب سرد حل می کنیم و به همراه ادویه وجعفری به سوپ اضافه می کنیم و صبر می کنیم تا دوباره به جوش بیاد و بوی خامی ارد بره.\n" +
                        "در آخر آبلیمو ورب گوجه را به سوپ اضافه می کنیم. و صبر می کنیم تا سوپ جا بیفته …\n"));
        listsoap.add(new ItemRecycler(R.drawable.soupzorat,
                "سوپ ذرت با شیر",
                "شیر 3 پیمانه\n" +
                        "ذرت منجمد  2 پیمانه\n" +
                        "پیازچه 10 ساقه\n" +
                        "سیب زمینی  1 عدد\n" +
                        "کرفس 1 شاخه\n" +
                        "پیاز متوسط 1 عدد\n" +
                        "آرد گندم  1 قاشق سوپ خوری\n" +
                        "کره  ½ قاشق سوپ خوری\n" +
                        "آویشن خشک  ½ قاشق چای خوری\n" +
                        "جعفری  ¼ پیمانه\n" +
                        "روغن زیتون  به مقدار لازم\n",
                " پوست سیب زمینی ها را گرفته و به شکل مکعب های کوچک خرد می کنیم.\n" +
                        "کره را در یک قابلمه متوسط بر روی شعله متوسط حرارت داده و ساقه های خرد شده کرفس و سیب زمینی را همراه با پیاز و آویشن اضافه کرده و شروع به هم زدن می کنیم تا جایی که سبزیجات شروع به قهوه ای رنگ شدن کنند.\n" +
                        "    آرد را بر روی سیزیجات پاشیده و چند دقیقه دیگر مواد را هم می زنیم.\n" +
                        "    شیر را بر روی مواد ریخته و شعله را بالا می بریم تا موادمان به جوش بیاید و ضمنا دائم سوپ را هم می زنیم تا مواد به ته ظرف نچسبند.\n" +
                        "    شعله را کم کرده سوپ را می پزیم تا سیب زمینی ها نرم و ملایم شوند اما نباید خمیر یا پوره مانند شوند. این امر حدود 10 دقیقه زمان می برد.\n" +
                        "در این بین، برگ های کرفس را خرد می کنیم، همین طور انتهای پیازچه ها را گرفته و به صورت نازک برش می دهیم. همین که سیب زمینی ها نرم شدند، دانه های ذرت، کمی روغن زیتون را همراه با پیازچه و برگ های کرفس اضافه می کنیم.\n" +
                        "    می گذاریم سوپ روی شعله ملایم گاز جا بیفتد و غلظت مد نظر ما را بدست آورد سپس سرو می کنیم.\n"));
        listsoap.add(new ItemRecycler(R.drawable.soupminestrone,
                "سوپ مینسترون (Minestrone Soup)",
                "روغن زیتون 1 قاشق غذا خوری\n" +
                        "تره فرنگی 3 عدد\n" +
                        "سیر  دوحبه ریز خرد شده\n" +
                        "هویج خرد شده  6 عدد\n" +
                        "ساقه کرفس  4 عدد خرد شده\n" +
                        "سیب زمینی 2 عدد بزرگ\n" +
                        "کدو خیاری 2 عدد\n" +
                        "گوجه فرنگی 4 عدد خرد شده\n" +
                        "کلم بروکلی ½ یک گل متوسط\n" +
                        "پیازچه 3 عدد\n" +
                        "جعفری تازه خرد شده ½پیمانه\n" +
                        "نمک و فلفل سیاه تازه خرد شده   به میزان لازم\n" +
                        "برگ بو   1 عدد\n" +
                        "آب مرغ  1 لیتر\n" +
                        "آب   ½1 پیمانه\n" +
                        "کنسرو لوبیا سفید پخته  35 گرم\n" +
                        "پنیر پارمزان رنده شده  1 پیمانه\n" +
                        "سرکه سفید  ¼ پیمانه\n" +
                        "دانه ذرت  1پیمانه\n",
                "  در یک قابلمه بزرگ، روغن زیتون را روی حرارت متوسط داغ می کنیم.\n" +
                        "    تره فرنگی (ترجیحاً از قسمت های سفید استفاده می\u200Eکنیم که لطیف تر و تازه تر است) را اضافه کرده (به جای تره فرنگی از یک عدد پیاز هم می توانید استفاده کنید) و حدود 4 دقیقه آن را سرخ می کنیم تا زمانی که نرم شود اما قهوه ای نشود.\n" +
                        "    سیر، هویج، کرفس و سیب زمینی ها را پوست کنده و به مکعب های 2 سانتی خرد کرده و اضافه می کنیم و 3 دقیقه دیگر سرخ می کنیم. کدو خیاری را مکعبی خرد می کنیم، کلم بروکلی، پیازچه و نیمی از جعفری را اضافه کرده و خوب هم می زنیم. گوجه فرنگی ها، نمک و فلفل، برگ بو ، آب مرغ (آب مرغ خانگی یا کنسرو شده کم سدیم)، آب و در صورت تمایل سرکه را اضافه می کنیم و شعله را زیاد می کنیم. آن را به نقطه جوش رسانده و سپس حرارت را کم می کنیم، روی حرارت نسبتاً پایین، در آن را نیمه باز قرار داده و می گذاریم 30 تا 45 دقیقه آهسته بجوشد، یا تا زمانی که سیب زمینی ها و سبزیجات نرم شوند.\n" +
                        "    برگ بو را از سوپ جدا می کنیم و طعم آن را می چشیم. اگر طعم ضعیفی دارد، می گذاریم 5 تا 10 دقیقه دیگر با قوت بجوشد و کم کم آن را کم می کنیم. در صورت تمایل ذرت و لوبیای پخته و آب گرفته را اضافه کرده و 2 دقیقه دیگر می گذاریم بجوشد.\n" +
                        "    باقی جعفری را درست قبل از سرو کردن آن روی سوپ می پاشیم و پنیر رنده شده را کنار آن سرو می کنیم.\n"));
        listsoap.add(new ItemRecycler(R.drawable.soupitaliaee, "سوپ گیاهی ایتالیایی", "مواد لازم سوپ", "طرز تهیه سوپ"));
        listsoap.add(new ItemRecycler(R.drawable.soupmeigu, "ﺳﻮپ ﻣﻴﮕﻮ ﺗﻨﺪ", "مواد لازم سوپ", "طرز تهیه سوپ"));
        listsoap.add(new ItemRecycler(R.drawable.souptailandi, "سوپ تایلندی تام یام", "مواد لازم سوپ", "طرز تهیه سوپ"));
    }

    public void setRejimi() {
        listrejimi = new ArrayList<>();
        listrejimi.add(new ItemRecycler(R.drawable.rejimiomlet,
                "املت کبابی رژیمی",
                "اسفناج به مقدار لازم\n" +
                        "گوجه فرنگی 4 عدد\n" +
                        "زعفران به مقدار لازم\n" +
                        "روغن زیتون به مقدار لازم\n" +
                        "نمک و فلفل به مقدار لازم\n" +
                        "تخم مرغ 4 عدد\n",
                "1-ابتدا مقدار كمی اسفناج را بخار پز كرده و به آن نمك و فلفل اضافه كنید.چند عدد گوجه فرنگی سفت و پهن را انتخاب كرده و سر آن را كمی بكنید و با قاشق داخل آن را خالی كنید طوری كه دیواره و كف گوجه فرنگی ۱تا۲سانت ضخامت داشته باشد.\n" +
                        "2-سینی فر را با كمی روغن زیتون چرب كنید.داخل هر گوجه فرنگی مقداری اسفناج پخته شده، نمك،زعفران،ادویه و سایر مواد دلخواه را اضافه كرده و یك عدد تخم مرغ داخل آن بشكنید.\n" +
                        "3-مواد داخل گوجه ها را كمی با روغن تفت دهید و داخل سینی فر بریزید و كمی رویش اسفناج ریخته و بعد گوجه ها را روی آن قرار دهید.\n" +
                        "4-سینی را درون فر قرار دهید و اجازه دهید با حرارت فر گوجه ها کبابی و نرم شوند و تخم مرغ ها بپزند ، پس از اماده شدن سینی را از فر خارج کنید و مقداری روغن زیتون روی تخم ها بریزید.\n"));
        listrejimi.add(new ItemRecycler(R.drawable.rejimipolosabzijat,
                "پلو سبزیجات با لوبیا قرمز",
                "روغن مايع سه قاشق غذاخوري\n" +
                        "برنج 250 گرم\n" +
                        "فلفل دلمه اي سبزو پیاز نگيني خرد شده هر کدام يك عدد\n" +
                        "پودر چيلي(فلفل قرمز تند) يك قاشق چايخوري\n" +
                        "ذرت پخته 150 گرم\n" +
                        "لوبيا قرمز پخته 225 گرم\n" +
                        "گشنيز تازه خرد شده دو قاشق غذاخوري\n" +
                        "زعفران آب كرده نمک و فلفل زردچوبه به ميزان لازم\n",
                "در تابه روغن را گرم سپس پيازها را اضافه كرده كمي كه سبك شد فلفل قرمز و زردچوبه را اضافه مي كنيم. بعد از آن فلفل دلمه را اضافه كرده و لوبيا قرمز را كه قبل پخته ايم را مي ريزيم و ذرت پخته را به آن مي افزاييم. برنج را درون آبي كه از قبل به جوش آورده ايم همراه با نمك ريخته و كمي زنده تر آبكش مي كنيم سپس درون قابلمه لايه لايه از برنج، مواد و گشنيز ريخته و در آخر زعفران آب كرده را مي ريزيم."));
        listrejimi.add(new ItemRecycler(R.drawable.rejimikababgiahi,
                "کباب سبزیجات مخصوص",
                "کدو سبز 2 عدد\n" +
                        "پیاز 1 عدد\n" +
                        "قارچ دکمه ای 250 گرم\n" +
                        "فلفل دلمه ای 1 عدد\n" +
                        "روغن زیتون یا مایع 2 قاشق غذاخوری\n" +
                        "سیر 3 حبه\n" +
                        "پودر فلفل قرمز 1/4 قاشق چایخوری\n" +
                        "پودر گشنیز 1 قاشق چایخوری\n" +
                        "پودر زیره سبز 1/4 قاشق چایخوری\n" +
                        "آبلیمو 2 قاشق غذاخوری\n" +
                        "جعفری و گشنیز خرد شده از هر کدام 2 قاشق غذاخوری\n" +
                        "سرکه سفید و نمک مقدار لازم\n",
                "1- برای تهیه سس مخصوص کباب ابتدا روغن زیتون ، پودر زیره ، پودر گشنیز ، آبلیمو ، سیر و پودر فلفل قرمز را داخل میکسر بریزید ، نمک و چند قاشق سرکه اضافه کنید و بزنید تا سس یکدست شود.\n" +
                        "2- در انتها جعفری و گشنیز خرد شده را به سس اضافه کنید و کمی بزنید (نیازی به میکس کردن کامل جعفری و گشنیز نیست. بهتر است خرده های جعفری و گشنیز داخل سس مشخص باشد).\n" +
                        "3- کدو سبز را حلقه ای خرد کنید ، فلفل دلمه ای و پیاز را نیز درشت خرد کنید ؛ سبزیجات خرد شده را به همراه قارچ داخل کیسه فریزر بریزید و سس را اضافه کنید ، با تکان دادن سبزیجات را به سس اغشته کنید ، در کیسه را ببندید و حداقل به مدت 4 ساعت داخل یخچال قرار دهید تا سبزیجات مزه دار شوند.\n" +
                        "4- سیخ های چوبی را 30 دقیقه در اب خیس دهید ، سبزیجات را به سیخ های چوبی بکشید سپس داخل سینی فر که چرب کرده اید قرار دهید ، گریل بالا را روشن کنید و هر چند دقیقه بچرخانید تا سبزیجات کبابی و نرم شوند سپس سرو کنید.\n"));
        listrejimi.add(new ItemRecycler(R.drawable.rejimiesmoti, "اسموتی کیوی با نعناع", "مواد لازم رژیمی", "طرز تهیه رژیمی"));
        listrejimi.add(new ItemRecycler(R.drawable.rejimisalad, "سالاد سیب زمینی رژیمی", "مواد لازم رژیمی", "طرز تهیه رژیمی"));
        listrejimi.add(new ItemRecycler(R.drawable.rejimikeik, "کیک شکلاتی فوری (کم کالری)", "مواد لازم رژیمی", "طرز تهیه رژیمی"));
    }

    public void setDaneshjuee() {
        listdaneshjoee = new ArrayList<>();
        listdaneshjoee.add(new ItemRecycler(R.drawable.danesgzorat,
                "ذرت مکزیکی",
                "ذرت شیرین 500 گرم\n" +
                        "نمک و فلفل به میزان لازم\n" +
                        "قارچ 250 گرم\n" +
                        "پنیر پیتزا 100 گرم\n" +
                        "آویشن 1 ق چ\n" +
                        "کره 30 گرم\n" +
                        "روغن مایع 3 تا 4 ق س\n" +
                        "سس مایونز 1 و نیم پیمانه\n" +
                        "نمک 1 ق چ\n" +
                        "فلفل سیاه نصف ق چ\n" +
                        "فلفل قرمز 1/2 ق چ\n" +
                        "پودر گلپر 1 ق چ\n" +
                        "ادویه کاری 1/2 ق چ\n",
                "رای درست کردن ذرت مکزیکی میتوانید از ذرت های شیرین تازه و یا از کنسرو ذرت استفاده کنید.قارچ ها را هم خرد میکنیم و در یک قابلمه ای که 2/3 آن را پر از آب کردیم و مقداری آبلیمو ریختیم و روی حرارت به جوش آمد میریزیم و فقط در حدی که یک جوش بخورد داخل قابلمه نگه میداریم و سریع داخل آبکش میریزیم و زیر آب سرد نگه میداریم .\n" +
                        "بعد از این مراحل، کره و روغن مایع را داخل قابلمه ای میریزیم تا داغ شود و بعد ذرت را داخل کره و روغن کمی تفت میدهیم در حدی که طعم دار شوند. بعد قارچ ها ی بلانچ شده را داخل آن میریزیم و در حد هم زدن و مخلوط کردن تفت میدهیم .\n" +
                        "نمک ، فلفل ، و بقیه ادویه ها را هم اضافه میکنیم و هم میزنیم تا مواد روی حرارت گرم شوند .\n"));
        listdaneshjoee.add(new ItemRecycler(R.drawable.daneshmakaroni,
                "ماکارونی",
                "ماکارونی:1 بسته\n" +
                        "فلفل دلمه:1عدد\n" +
                        "نخود فرنگی:100 گرم\n" +
                        "پیازمتوسط:2عدد\n" +
                        "رب:2 قاشق غذا خوری\n" +
                        "قارچ:200گرم\n" +
                        "گوشت چرخ کرده:300 گرم\n" +
                        "نمک و ادویه کاری:به مقدار لازم\n",
                "تابه ای را روی حرارت قرار دهید و مقداری روغن داخلش بریزید تا داغ شود. بعد پیاز را داخل روغن تفت دهید تا طلایی شود.  سپس گوشت را به پیاز سرخ شده اضافه کنید و تفت دهید  تا گوشت کمی سرخ شود و رنگش تغییر کند.\n" +
                        "بعد از تفت گوشت فلفل دلمه و قارچ خرد شده را هم به آن اضافه کنید و تفت دهید تا نرم شوند. در آخر رب گوجه را به مواد تفت داده شده اضافه کنید و کمی تفت دهید تا رنگ رب باز شود.\n" +
                        "و به همراه یک استکان آب جوش بگذارید تا گوشت بپزد و آب آن  کاملا جذب شود. در مرحله بعد ماکارونی را طبق دستور بپزید و آبکش کنید .\n" +
                        " ته قابلمه مورد نظر تان را چرب کنید و کف آن ته دیگ سیب زمینی بچینید و مقداری از ماکارونی را روی آن بریزید و روی ماکارونی مقداری آز مواد گوشت تفت داده شده بریزید و این لایه را آنقدر تکرار کنید تا تمام شوند.\n" +
                        "البته میتوانید ماکارونی و مایه گوشت را قبل ریختن در قابلمه با هم مخلوط کنید و یکجا در قابلمه بریزید و دم دهید.\n"));
        listdaneshjoee.add(new ItemRecycler(R.drawable.daneshestamboli,
                "استانبولی پلو",
                "گوشت مغز ران بدون استخوان :750گرم\n" +
                        "برنج :یک کیلو\n" +
                        "رب گوجه فرنگی :یک قاشق سوپخوری\n" +
                        "گوجه فرنگی:سه کیلو\n" +
                        "پیاز سرخ کرده  :3 تا 4 قاشق سوپخوری\n" +
                        "روغن :100 تا 150گرم\n" +
                        "نمک و فلفل :به مقدار کافی\n",
                "ابتدا برنج را تمیز کنید و با آب ولرم بشویید . بعد گوجه فرنگی ها را بشویید و آب آن را بگیرد و به همراه آب معمولی پیمانه کنید و روی برنج بریزید ، به حدی که 4 انگشت از سطح برنج بالاتر به ایستد. \n" +
                        "به اندازه کافی نمک به آن اضافه کنید و آب آن را بچشید تا خیلی شور نشود. چون برنج به صورت کته درست میشود باید در میزان ریختن نمک دقت کنید و کم کم نمک را بریزید تا به مزه دلخواه برسید.\n" +
                        "بعد 3 تا 4 قاشق روغن هم داخل آب برنج بریزد و بگذارید تا برنج یکی دو ساعت خیس بخورد. گوشت را به صورت خیلی ریز خرد کنید ( به صورت قیمه ای ) و به همراه پیاز سرخ کرده تفت دهید تا آب گوشت کشیده شود.\n" +
                        "بعد 2 تا 3 لیوان آب داخل گوشت تفت داده شده بریزید تا گوشت با حرارت کم بپزد.در حین پخت ، به آن رب و کمی نمک هم اضافه کنید .\n" +
                        "بعد از اینکه گوشت کاملا پخته شد و آب آن تبخیر شد . برنج را روی حرارت قرار دهید تا به جوش بیاید و آب آن تبخیر شود.\n" +
                        "اگر حس کردید آب برنج کم است و مغز برنج کمی خام است به آن یکی دو پیمانه آب یا آب گوجه فرنگی اضافه کنید.\n" +
                        "بعد از تبخیر کامل آب برنج ، وسط آن را باز کنید و گوشت قیمه را وسط آن قرار دهید و بعد با برنج روی آن را بپوشانید .\n" +
                        "در قابلمه را محکم ببندید و روی حرارت کم قرار دهید تا برنج دم بکشد.این برنج را میتوانید در فر هم به مدت نیم ساعت با حرارت 350 درجه و یا یکساعت با حرارت 300 در جه هم دم کنید.\n" +
                        "استامبولی را میتوانید با گوشت چرخ کرده و یا رب گوجه فرنگی هم تهیه کنید. که در اینصورت باید حدود یک لیوان از رب مرغوب استفاده کنید.\n" +
                        "برای پیمانه کردن برنج هم بهتر است به ازای هر پیمانه برنج یک و نیم تا 2 پیمانه آب در نظر بگیرید.\n" +
                        "اگر هم از گوشت چرخ کرده استفاده کردید ، بهتر است گوشت را با پیاز سرخ کنید و یک قاشق رب را در یک لیوان آب مخلوط کنید و داخل گوشت بریزید تا به آرامی گوشت بپزد و آبش کشیده شود.\n" +
                        "استامبولی پلو با آب گوجه فرنگی تازه و گوشت قیمه ای خیلی بهتر میشود.\n"));
        listdaneshjoee.add(new ItemRecycler(R.drawable.daneshomlet, "املت", "مواد لازم دانشجویی", "طرز تهیه دانشجوی"));
        listdaneshjoee.add(new ItemRecycler(R.drawable.daneshkoko, "کوکو تن ماهی با سیب زمینی", "مواد لازم دانشجویی", "طرز تهیه دانشجوی"));
        listdaneshjoee.add(new ItemRecycler(R.drawable.daneshdampokhtak, "دمی گوجه", "مواد لازم دانشجویی", "طرز تهیه دانشجوی"));
    }

    public void setTangholat() {
        listtanagholat = new ArrayList<>();
        listtanagholat.add(new ItemRecycler(R.drawable.tanaqolatlavashak,
                "لواشک انار و به",
                "به     1 عدد بزرگ\n" +
                        "دانه انار یا آب انار   2 لیوان\n" +
                        " آبلیمو3 قاشق غذاخوری\n",
                "به را خوب بشوید و به قطعات کوچک تر خرد کنید و تخم آن را جدا کنید.دانه های انار را هم داخل میکسر بریزید تا عصاره آن خارج شود.حتی میتوانید از آب انار هم استفاده کنید که راحت تر است.\n" +
                        "سپس به ریز شده را به همراه آب انار و 3 قاشق آب لیمو داخل قابلمه ای بریزید و قابلمه را روی حرارت ملایم قرار دهید تا به جوش بیاید. بعد از اینکه به جوش آمدند اجازه دهید تا با حرارت کم مواد لواشک به مدت نیم ساعت آرام آرام بجوشند.اگر حس کردید لواشک خیلی ترش میشود میتوانید در این مرحله 1 قاشق شکر هم به آن اضافه کنید تا به همراه بقیه مواد بجوشد.\n" +
                        "پس از سپری شدن این زمان مواد را از روی حرارت بردارید و بگذارید تا کمی خنک شود.سپس داخل میکسر بریزید تا به شکل پوره شوند.\n" +
                        "داخل سینی فر یک کاغذ روغنی بیندازید و موااد پوره شده را به صورت نازک روی کاغذ پخش کنید .\n" +
                        "سینی را داخل فر به مدت 1 تا 2 ساعت  با دمای 120 درجه سانتی گراد  قرار دهید تا لواشک خودش را بگیرد.\n" +
                        "سینی را از فر خارج کنید تا لواشک سرد شود و بتوانید مصرف کنید.\n" +
                        "لواشک های آماده شده را به اندازه های دلخواه ببرید و در کیسه فریزر نگهداری کنید.\n"));
        listtanagholat.add(new ItemRecycler(R.drawable.tanaqolatzhele,
                "ژله آب نبات چوبی",
                "۱ بسته ژله قرمز طعم دلخواه\n" +
                        "۱ بسته ژله ابی طعم دلخواه\n" +
                        "ژله سفید( ژله شیر عسلی یا بستنی)\n" +
                        "رنگ و طعم ژله ها به دلخواه خودتان قابل تغییر است.\n",
                "ابتدا دو رنگ ژله( در اینجا سفید و قرمز) را اماده کنید ودر ظرف کم عمق مستطیل شکل بریزید و در یخچال بگذارید تا کاملا ببندد.بعد به مکعب های کوچک ببرید.\n" +
                        "مکعب ها رنگی را مخلوط کرده داخل قالب مستطیل شکل دیگری بریزید.\n" +
                        "ژله پایه را(در اینجا ابی) به رنگ دلخواه اماده کنید اجازه دهید تا خنک شود بعد روی خرده ژله ها در حدی بریزید که ۳/۴ سطح ژله ها را بپوشاند.بنابر این مقداری از ژله پایه شما اضافه می ماند و روی خرده ژله ها کامل پوشیده نمیشود.\n" +
                        "داخل یخچال قرار دهید تا کاملا بسته شود.\n" +
                        "از یخچال در اورده لبه های ژله را ازاد کرده و روی سطح نچسبی برگردانید.\n" +
                        "ژله را به شکل نبات به عرض حدود ۲ سانتی متر ببرید .لبه چاقو را جوری حرکت دهید که موقع برش لبه های ناصاف ایجاد کند تا شکل نبات ایجاد شود.از انتهای ژله ها نی نازک فرو کنید تا ۲/۳ ژله.\n" +
                        "اگر عرض برش کم باشد موقعی که نی میزنید شکسته خواهد شد.\n" +
                        "در ظرف مناسبی بچینید و سرو کنید.\n"));
        listtanagholat.add(new ItemRecycler(R.drawable.tanaqolatmive,
                "میوه خشک",
                "میوه های کوچک مثل انگور، توت فرنگی، گیلاس و گوجه فرنگی مینیاتوری را می توان به صورت درسته خشک کرد. میوه های متوسط را می توان نصف یا حلقه حلقه کرد و میوه های بزرگ یا خیلی سفت مثل انبه، آناناس و نارگیل را باید ورقه ورقه کرد.",
                " اگر دوست دارید پوست میوه ها را بگیرید ، تکه های میوه را 30 ثانیه در آب جوش بریزید و سپس به یک ظرف آب یخ منتقل کنید تا پوست میوه ها راحت جدا شود.\n" +
                        " برای حفظ ظاهر زیبای میوه ها و به حداقل رسیدن تغییر رنگ شان آنها را 10 دقیقه درون آب لیمو و آب قرار دهید، سپس در آبکش بریزید و با یک حوله ی بدون پرز به آرامی خشک کنید.\n" +
                        " فر را از قبل در دمای 54 تا 71 درجه ی سانتی گراد گرم کنید.\n" +
                        " از درجه ی حرارت پایین تر برای میوه های برش خورده ی نازک مانند سیب یا هلو و از دمای بالاتر برای توت فرنگی ها و سایر توت های کامل استفاده کنید.\n" +
                        " روی سینی فر را با کاغذ مومی بپوشانید و تکه های میوه را با حفظ فاصله بچینید.\n" +
                        "یک توری گرد مخصوص پیتزا یا یک لاینر سیلیکونی روی میوه ها برای جلوگیری از جمع شدن (لوله شدن) آنها قرار دهید.\n" +
                        " میوه ها را درون فر بگذارید و هر دو ساعت سینی فر را بچرخانید.\n" +
                        " هنگامی که میوه خشک بافتی مانند چرم پیدا کرد و حدی منعطف بود، آماده بیرون آوردن از فر است.\n" +
                        " بعد از بیرون آوردن میوه های خشک از فر آنها را در ظرف های پلاستیکی یا شیشه ای بریزید و برای 4 تا 5 روز سر ظرفها را باز بگذارید تا رطوبت باقی مانده آنها تبخیر شود. در طی این روزها ظرف را ، تکان دهید تا میوه ها کمی جابه جا شوند.پس از 5 روز، در ظرف را ببندید\n" +
                        " حدود 10 ماه بعداز این میوه های خشک می توانید استفاده کنید.\n"));
        listtanagholat.add(new ItemRecycler(R.drawable.tanaqolatalu, "آلوی شکلاتی", "مواد لازم تنقلات", "طرز تهیه تنقلات"));
        listtanagholat.add(new ItemRecycler(R.drawable.tanaqolatqand, "قندهای رنگی", "مواد لازم تنقلات", "طرز تهیه تنقلات"));
        listtanagholat.add(new ItemRecycler(R.drawable.tanaqolatmoz, "موز یخ زده با روکش شکلات", "مواد لازم تنقلات", "طرز تهیه تنقلات"));
    }


    @Override
    public void onBackPressed() {
        ActivityDastebandi.tanagholat = false;
        ActivityDastebandi.daneshjuee = false;
        ActivityDastebandi.rejimi = false;
        ActivityDastebandi.sonati = false;
        ActivityDastebandi.modern = false;
        ActivityDastebandi.soap = false;

        super.onBackPressed();
    }

    //======================change font===============================
    @Override
    protected void attachBaseContext(Context newBase) {
        super.attachBaseContext(CalligraphyContextWrapper.wrap(newBase));
    }
}
